## 2.1 Вычисления с помощью Numpy

### Задание 1<br>
Импортируйте библиотеку $\mathsf{\color{darkblue}{Numpy}}$ и дайте ей псевдоним np.
Создайте массив $\mathsf{\color{darkblue}{Numpy}}$ под названием $\mathbf{\color{blue}{a}}$ размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод $\mathbf{\color{green}{mean}}$ массива $\mathsf{\color{darkblue}{Numpy}}$. Результат запишите в массив $\mathbf{\color{blue}{mean\underline{\;} a}}$, в нем должно быть 2 элемента.<br>

__Решение:__<br>

In [1]:
import numpy as np

In [2]:
a = np.transpose(np.array([[1, 2, 3, 3, 1],
             [6, 8, 11, 10, 7]]))
print(f'Массив a:\n{a}')

Массив a:
[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [3]:
mean_a = np.mean(a, axis=0)
mean_a

array([2. , 8.4])

### Задание 2<br>
Вычислите массив $\mathbf{\color{blue}{a\underline{\;} centered}}$, отняв от значений массива “$\mathbf{\color{blue}{a}}$” средние значения соответствующих признаков, содержащиеся в массиве $\mathbf{\color{blue}{mean\underline{\;} a}}$. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.<br>

__Решение:__<br>

In [4]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### Задание 3<br>
Найдите скалярное произведение столбцов массива $\mathbf{\color{blue}{a\underline{\;} centered}}$. В результате должна получиться величина $\mathbf{\color{blue}{a\underline{\;} centered\underline{\;} sp}}$. Затем поделите $\mathbf{\color{blue}{a\underline{\;} centered\underline{\;} sp}}$ на N-1, где N - число наблюдений.<br>

__Решение:__<br>

In [5]:
a_centered_sp = (a_centered[:, 0] @ a_centered[:, 1])
a_centered_sp

8.0

In [6]:
N_1 = a_centered.shape[0] - 1
N_1

4

In [7]:
a_centered_sp / N_1

2.0

### $^*$Задание 4<br>
Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “$\mathbf{\color{blue}{a}}$”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.<br>
В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции $\mathbf{\color{green}{np.cov}}$. В качестве аргумента m функция $\mathbf{\color{green}{np.cov}}$ должна принимать транспонированный массив “$\mathbf{\color{blue}{a}}$”. В получившейся ковариационной матрице (массив $\mathsf{\color{darkblue}{Numpy}}$ размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.<br>

__Решение:__<br>

In [8]:
m = a.transpose()
m

array([[ 1,  2,  3,  3,  1],
       [ 6,  8, 11, 10,  7]])

In [9]:
t = np.cov(m)
t

array([[1. , 2. ],
       [2. , 4.3]])

In [10]:
t[0, 1]

2.0

## 2.2 Работа с данными в Pandas

### Задание 1<br>
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:
[1, 1, 1, 2, 2, 3, 3], ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'], [450, 300, 350, 500, 450, 370, 290].<br>

__Решение:__<br>

In [11]:
import pandas as pd

In [12]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [13]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2<br>
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.<br>

__Решение:__<br>

In [14]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3<br>
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.<br>

__Решение:__<br>

In [15]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4<br>
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price, в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.<br>

__Решение:__<br>

In [29]:
stat = authors_price.groupby('author_name').agg({'price': ['min', 'max', 'mean']})
stat

            price
              min  max        mean
author_name
Островский    290  370  330.000000
Тургенев      300  450  366.666667
Чехов         450  500  475.000000

In [31]:
authors_stat = stat.rename(columns={min:'min_price', max:'max_price', 3:'mean_price'})
authors_stat

            price
              min  max        mean
author_name
Островский    290  370  330.000000
Тургенев      300  450  366.666667
Чехов         450  500  475.000000

### $^*$Задание 5<br>
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка: ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']. Просмотрите документацию по функции $\mathbf{\color{green}{pd.pivot\underline{\;} table}}$ с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy. Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.<br>

__Решение:__<br>

In [21]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [22]:
?pd.pivot_table

In [23]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [24]:
book_info.to_pickle('book_info.pkl')

In [25]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950